{
    "finnish": "Finnish",
    "english": "English",
    "swedish": "Swedish",
    "homenav": "Home",
    "about-header": "About me",
    "about": "NOTE: The code snippets are really old as my coding in recent years has happened at work. My name is Jere Pankka and I graduated in June 2025 with a Master's degree from Aalto University, majoring in Information and Service Management. I am also currently finalizing my second Master's degree at Tampere University, majoring in Software, Web and Cloud. My degree from Aalto combined business with technology, while my studies at Tampere have focused more deeply on the technical side, giving me a strong foundation in both areas. My studies have provided me with expertise in business and data analysis, intermediate knowledge in web development, and basics of mobile development (React Native + Expo). Beyond technical skills, I have gained experience in managing software projects, sustainable software engineering, human-computer interactions, and the Internet of Things. I acted as a Project Manager for a team of seven developers on the COMP.SE.620 course at Tampere University. My role involved typical PM responsibilities such as maintaining the project's big picture and delegating work, while I also actively contributed to the codebase. The project, which featured a Django backend and a Vue + Bootstrap frontend, received full marks. This was a typical software engineering project executed in two-week sprints (5 sprints for implementation and one for QA). The process included sprint retrospectives, weekly group meetings for coding and discussion, and an iterative approach to requirements gathering that began at the project's outset. I have a strong personal interest in sports analytics, which is reflected in my theses. My Aalto thesis (grade 5/5) researched predicting football transfer fees through machine learning, involving data collection, cleaning, feature engineering, and predictive modeling with Python. My second thesis at Tampere University (grade 4/5) focused on automating xG-based football predictions using a Monte Carlo simulation and an MLOps style pipeline for automated weekly predictions. The theses can be provided as a PDF upon further request. My academic background also includes a strong emphasis on CI/CD pipelines and GitHub Actions for automating software and data workflows.",
    "about1": "I have almost 4 years of expertise in a Data Analyst role at Alma Insights Oy, specifically working within a financial data context. I have gained high-level expertise in data manipulation, planning optimal data models (star and snowflake schemas) tailored to project needs, developing user-friendly reports, and optimizing their performance. My Power BI expertise covers the entire lifecycle, including development pipelines, GitHub integration for version control, and a deep understanding of the Formula Engine and Storage Engine for advanced optimization. My daily toolkit includes SQL, DAX, Tabular Editor, DAX Studio, Python, and GitHub. I also excel at communicating complex information clearly to both technical and non-technical audiences. Since the start of 2025, I have shifted more towards Data Engineering, expanding my use of Python and GitHub while incorporating AWS and Apache Airflow. This transition has allowed me to build and maintain robust data pipelines. Currently, my main interests lie in data-related positions such as Data Analyst, Data Scientist, and Data Engineer, where I can leverage my combined business and technical background to solve complex problems.",
    "work-exp": "Work experience",
    "jobs": [
        "Alma Insights Oy (18.2.2022-)",
        "Tampere University (Course Assistant, 1.10.2025-1.1.2026)",
        "Aalto University, Dept. of CS (Course Assistant, 1.9.2024-1.1.2025)",
        "Fazer Leipomot Oy (14.4.2020-5.8.2022)",
        "Finnish Defence Forces (4.9.2020-11.3.2020)",
        "Mediatalo ESA (22.5.2019-20.5.2019)",
        "Vierumäki Golf Club Oy (4.6.2018-12.8.2018)"
      ],
    "jobdesc": [
        "Started with processing and making adjustments to financial statements before shifting responsibilities towards Power BI. In this role, I have been in charge of the Power BI environment, including project management, conducting customer interviews, and collecting feedback. I focus on delivering information-packed financial reports with careful data planning and performance optimization using tools like DAX Studio. Recently, I have shifted further towards data engineering, utilizing Python, GitHub, Apache Airflow, and AWS for managing complex data tasks.",
        "Working as a course assistant for Tampere University's course COMP.SE.200 Software Testing. Duties include grading group works that have two phases: making a test plan in phase 1 and writing the tests + test report in phase 2.",
        "Course assistant for the course CS-C3150 Software Engineering offered by the department of computer science in Aalto University. Tasks include grading essays regarding different topics of the field of software engineering.",
        "Full-time employee: 4/2020-8/2020 and 6/2021-8/2021 & Part-time employee: 8/2020-5/2021 and 8/2021-8/2022",
        "Doing my military service in Ruotuväki, the official newspaper of the Finnish Defence Forces. Working as a customer servant and representing Ruotuväki in different events, such as Studia. Furthermore, I wrote articles, news and columns for the website and print. Working in Ruotuväki gave me valuable knowledge in working with different kinds of customers, conducting interviews and writing articles for a news paper.",
        "Worked as a paperboy doing night shifts.",
        "Golf related tasks such as collecting golf balls from the driving range."
      ],
      "read_more": "Read more",
      "read_less": "Read less",
    "read_abstract": "Thesis abstract",
    "aalto-abstract": "This study aims to find out whether a transfer fee paid for a football player can be explained with performance statistics, which is the player’s performance before the transfer happened.\nData is gathered from the highest tier of football in five different countries: England, France, Germany, Italy, and Spain. These are the biggest football leagues in the world. Only summer transfers are considered, and the transfers are gathered from years 2018, 2019, 2020, 2021, 2022, 2023 and 2024. From the players transferred during these years, performance statistics from their prior seasons are collected. Several data point exclusions are made, for example loans, free transfers, and goalkeepers are removed. Furthermore, inadequate data points are dropped, for instance if contract length is not found. Dataset is divided into defenders, midfielders, and attackers, each of which have their own regression models. Feature engineering is performed before feature selection. The data is split into training and test sets with 80/20 split.\nThe main regression model is multiple linear regression. Feature selection is done with backward elimination. In addition, LASSO regression and random forest regression are performed to get benchmarks for the predictive performance and variance explained. LASSO regression performs its own feature selection while feature selection algorithm Boruta is used for random forest. Hyperparameter values of random forest are tuned. The results of the models are verbally analysed and mean squared error and root mean squared error of the predictions and R² as well as adjusted R² are used to compare the models and their results.\nThe results of multiple linear regression show that age, contract length as well as whether they transferred to the Premier League or out of it are statistically significant regardless of the player category. In addition to these not performance related variables, each category has multiple significant predictors that are performance based. For defenders these are percentage of aerial duels won, touches in attacking third, challenges lost, medium pass completion percentage, tackles in the middle third, npxG + xAG, and progressive carrying distance. For midfielders they are goal creating actions, interceptions, challenges lost, passes into final third, pass completion percentage, recoveries and xG. For attackers these are miscontrols, pass completion percentage, shots on target percentage, take-ons leading to a goal, tackled during takeon percentage, xAG and xG.\nThe results indicate that – to some extent – it is possible to explain the transfer fee paid with the performance of the player. However, limitations apply, and the results should be interpreted with caution.",
    "tampere-abstract": "Football result modelling has been researched since the 1960s. Different models and features have been used, but earlier literature regarding expected goals (xG) as a feature for the modelling is scarce. This study aims to investigate how xG can be used to simulate past results, which in turn can be used to predict future results. Furthermore, this study has the goal of automating the entire process with CI/CD, resulting in an MLOps style pipeline for the predictions.\nExtensive background and literature review are provided on the topic. This is followed by simulation and prediction. Data from the English Premier League from seasons 2020/2021 to 2024/2025 was used for providing historical results. Match-specific shot-level xG was used in combination with Monte Carlo simulation to simulate past results. These simulated results were utilised for future match prediction, which was done with independent Poisson distribution. The 𝜆 values for the Poisson distribution equalled the previous performances of both the home and the away team. The CI/CD pipeline ran automatically every day, and after each matchweek the results were simulated based on xG, and 𝜆 values were updated. The predictions for the next matchweek were made with the new values and the results were provided through an automated Telegram message. The chosen baseline model was the average of bookmaker odds, which has also been utilised in earlier literature. The performance of the models was looked at with the help of four different metrics. These were accuracy, return on investment, mean binomial deviance error and mean squared error.\nThe model built for the study achieved profitability in the long run. If all predictions for the historical seasons were considered, the accuracy was 50.67 % with a -0.77 % return on investment for a sample size of 1 800 matches. However, the model performed vastly better for later parts of the season, especially when only considering matches where the model had high confidence. If only the second half of the season was considered, the accuracy ranged between 75 % and 87 % for predictions where the model had a high confidence. For these, the return on investment percentages were between 7 % and 12 %. The independent Poisson model outperformed the baseline model in terms of return on investment on most occasions, even though the accuracy was lower.\nLimitations included the simplicity of the model and the model being only xG based, omitting possibly relevant features that affect the predictions. Furthermore, xG as a metric itself has limitations. Regardless of the limitations that apply, the results were encouraging.",
    "lang-ski": "Language skills",
    "lang-ski-list": ["Finnish (Mother tongue)", "English (Excellent)", "Swedish (Good)"],
    "IT-ski": "IT skills",
    "IT-ski-list": ["Microsoft Office (Excellent)", "Power BI (Excellent)", "SQL (Proficient)", "Python (Proficient)", "Web development (Competent)"],
    "cv_other_header": "Other",
    "cv_other": "In addition to my studies and part-time job, I'm trying to be active in the student community, both at the business school as well as whole Aalto. In 2022 I was in the board of EnerKY, which is a club at KY organizing low-threshold sports activities for other students. In 2023, I was in the board of KY-Vegas which gathers up people interested in different card games. Furthermore, in 2024 I will be in the board of Polin Pallo, which is a football team aimed at Teekkaris at Aalto. I will act as a secretary and I am also responsible for our web page. Some concrete examples of events I've been part of organizing include: adventure park day at Mustikkamaa, texas hold'em and UNO tournaments in Otaniemi and info events. Organizing different kinds of events of varying sizes for other students has been fruitful, and in additition it has polished my group working, planning and marketing skills as well as (student) community engagement. The WordPress website I am responsible for can be found here: ",
    "articleheader": "Articles written for Ruotuväki online",
    "prog": "Programming projects",
    "prog_text": "The project I have done both with Python and JavaScript can be found on my Github. There are projects that are related to course tasks but most of them are hobby projects of different sizes. The Python projects are mostly built from scratch by myself and one JS project is based on source code by other people.",
    "snapshots": "Snapshots",
    "ravit_desc": "Program made with React and Typescript that is an electronic version of the drinking game Ravit.",
    "apartmentfinder_desc": "Python program that searches apartments from Oikotie based on criteria given.",
    "kide_desc": "Python program for buying tickets from Kide.app. Has both auto-clicker version done with Selenium as well as API version done with requests and bs4.",
    "form_desc": "If you wanna contact me, shoot me a message through LinkedIn, for instance. The purpose of this form is to practice writing code which connects to external database and stores the info. Haven't had time to implement it yet.",
    "contact": "Contact",
    "form_name": "Name",
    "form_subject": "Subject",
    "form_details": "Details",
    "success_msg": "Success! Your message has been sent.",
    "behavioral-pres-header": "Behavioral economics & product strategy in the gaming industry",
    "behavioral-pres-intro": "I have a deep interest in how behavioral economics and psychology can be applied to product strategy and data analytics. Below is a presentation I've put together that explores these concepts in depth in the context of video games. Even though the presentation is in the context of video games, especially the pricing models apply across industries. The quality is not that great due to compression of the video. The slide set can be downloaded ",
    "here": "here",
    "pres-skip-text": "You can use the shortcuts below to skip directly to specific topics in the presentation:",
    "pres-pull-header": "Pull of video games",
    "pres-pull-btn1": "5m33s Self-determination theory and flow state",
    "pres-pull-btn2": "10m44s Zeigarnik effect and social cohesion",
    "pres-be-header": "Behavioral economics",
    "pres-be-btn1": "15m07s Pricing models",
    "pres-be-btn2": "21m26s Battle passes",
    "pres-be-btn3": "29m15s Loot boxes",
    "pres-be-btn4": "33m34s Limited time offers",
    "pres-be-btn5": "35m10s Personalized deals",
    "pres-kpi-header": "Key performance indicators",
    "pres-kpi-btn1": "39m52s Retention metrics",
    "pres-kpi-btn2": "41m57s Engagement metrics",
    "pres-kpi-btn3": "47m01s Conversion and revenue metrics",
    "pres-kpi-btn4": "49m06s Personalized deals and promotions metrics"
}