{
    "finnish": "suomi",
    "english": "englanti",
    "swedish": "ruotsi",
    "homenav": "Koti",
    "about-header": "Minusta",
    "about": "HUOM: Koodi-snippetit on tosi vanhoja, kun viime vuosina mun koodaus on tapahtunu vaan töissä. Morjes, nimeni on Jere Pankka. Valmistuin kesäkuussa 2025 kauppatieteiden maisteriksi Aalto-yliopistosta pääaineenani Information and Service Management (ISM). Olen myös loppusuoralla toisessa maisteritutkinnossani Tampereen yliopistossa, jossa pääaineenani on Software, Web and Cloud. Aallon tutkintoni yhdisti kaupallisen alan ja teknologian, kun taas Tampereen opintoni ovat keskittyneet syvemmälle tekniseen puoleen, antaen minulle vahvan osaamisen molemmilta alueilta. Opintoni ovat tuoneet minulle vahvaa osaamista bisnes- ja data-analyysista, keskitason osaamista web-kehityksestä sekä perusteet mobiilikehityksestä (React Native + Expo). Teknisten taitojen lisäksi olen kerryttänyt kokemusta ohjelmistoprojektien hallinnasta, kestävästä ohjelmistotuotannosta, ihmisen ja koneen välisestä vuorovaikutuksesta (HCI) sekä esineiden internetistä (IoT). Toimin projektipäällikkönä seitsemän kehittäjän tiimille Tampereen yliopiston COMP.SE.620-kurssilla. Vastuualueisiini kuuluivat tyypilliset projektipäällikön tehtävät, kuten kokonaiskuvan hallinta ja töiden delegointi, mutta osallistuin myös aktiivisesti sivuston koodaamiseen. Verkkosivusto toteutettiin Django-backendillä sekä Vue- ja Bootstrap-frontendillä, ja projekti sai täydet pisteet. Kyseessä oli tyypillinen ohjelmistotuotantoprojekti, joka toteutettiin kahden viikon sprinteissä (5 sprinttiä toteutukseen ja yksi sprintti laadunvarmistukseen). Prosessiin kuuluivat sprintti-retrospektiivit, viikoittaiset tiimipalaverit koodauksen ja keskustelun merkeissä, sekä iteratiivinen vaatimusmäärittely, joka aloitettiin heti projektin alussa. Minulla on vahva henkilökohtainen kiinnostus urheiluanalytiikkaan, mikä näkyy myös lopputyöissäni. Aallon pro graduni (5/5) tutki jalkapallon siirtosummien ennustamista koneoppimisen avulla, kattaen koko prosessin datan keräämisestä ja siivoamisesta piirteiden erotteluun ja ennustemallien sovittamiseen Pythonilla. Tampereen yliopiston diplomityöni (4/5) taas keskittyi xG-pohjaisten jalkapalloennusteiden automatisointiin hyödyntäen Monte Carlo -simulaatiota ja MLOps-tyylistä putkea viikoittaisten ennusteiden tuottamiseen. Gradut voin toimittaa PDF:nä kysyttäessä. Akateeminen taustani sisältää myös vahvan painotuksen CI/CD-putkiin ja GitHub Actionsiin ohjelmisto- ja datatyönkulkujen automatisoinnissa.",
    "about1": "Minulla on hieman vajaa 4 vuoden kokemus data-analyytikon roolista Alma Insights Oy:llä, erityisesti talousdatan parissa. Tämän myötä olen saavuttanut korkean tason osaamisen datan käsittelyssä, optimaalisten ja projektikohtaisten tietomallien (star- ja snowflake-skeemat) suunnittelussa, käyttäjäystävällisten raporttien kehittämisessä sekä niiden suorituskyvyn optimoinnissa. Power BI -osaamiseni kattaa koko elinkaaren, mukaan lukien kehitysputket, GitHub-integraation versionhallintaa varten sekä syvällisen ymmärryksen Formula Enginestä ja Storage Enginestä edistynyttä optimointia varten. Päivittäisessä käytössäni ovat olleet SQL, DAX, Tabular Editor, DAX Studio, Python ja GitHub. Lisäksi koen vahvuudekseni tiedon selkeän viestimisen sekä teknisille että ei-teknisille yleisöille. Vuoden 2025 alusta lähtien olen siirtynyt enemmän data engineeringin pariin, mikä on tuonut mukanaan monipuolisemman Pythonin ja GitHubin käytön sekä AWS:n ja Apache Airflow’n hyödyntämisen. Olen erikoistunut dataputkien rakentamiseen ja ylläpitoon. Tällä hetkellä olen kiinnostunut ensisijaisesti dataan liittyvistä työtehtävistä, kuten data-analyytikon, data scientistin tai data engineerin rooleista, joissa pääsen hyödyntämään yhdistettyä kaupallista ja teknistä taustaani.",
    "work-exp": "Työkokemus",
    "jobs": [
        "Alma Insights Oy (18.2.2022-)",
        "Tampereen yliopisto (Kurssiassistentti, 1.10.2025-1.1.2026)",
        "Aalto-yliopisto, Tietotekniikan laitos (Kurssiassistentti, 1.9.2024-1.1.2025)",
        "Fazer Leipomot Oy (14.4.2020-5.8.2022)",
        "Puolustusvoimat (4.9.2020-11.3.2020)",
        "Mediatalo ESA (22.5.2019-20.5.2019)",
        "Vierumäki Golf Club Oy (4.6.2018-12.8.2018)"
      ],
    "jobdesc": [
        "Aloitin tilinpäätösten käsittelyllä ja oikaisemisella ennen kuin siirryin vastaamaan Power BI -ympäristön kehityksestä ja projektinhallinnasta, sisältäen asiakashaastattelut ja palautteen keräämisen. Toimitan loppukäyttäjille tietotiheitä talousraportteja, joiden suorituskyvyn optimoinnissa hyödynnän esimerkiksi DAX Studiota. Viime aikoina olen siirtynyt yhä enemmän data engineeringin pariin, hyödyntäen Pythonia, GitHubia, Apache Airflow’ta sekä AWS:ää monipuolisten datatehtävien hallinnassa.",
        "Toimin kurssiassistenttina Tampereen yliopiston kurssilla COMP.SE.200 Software Testing. Tehtäviini kuuluu ryhmätöiden arvostelu, joka koostuu kahdesta vaiheesta: testisuunnitelman tekemisestä ensimmäisessä vaiheessa sekä testien kirjoittamisesta ja testiraportoinnista toisessa vaiheessa.",
        "Kurssiassistentti Aalto-yliopiston tietotekniikan laitoksen kurssilla CS-C3150 Ohjelmistotuotanto. Tehtäviin kuuluu ohjelmistotuotannon eri osa-alueita käsittelevien esseiden arvostelu.",
        "Tehdastyöntekijänä. Täysiaikaisena 4/2020-8/2020 sekä 6/2021-8/2021 ja osa-aikaisena 8/2020-5/2021 ja 8/2021-8/2022.",
        "Ruotuväkilehdessä levikkisihteerinä. Asikaspalvelutehtäviä, Ruotuväen edustamista tapahtumissa esimerkiksi Studia-messuilla sekä juttujen kirjoittamista nettiin ja printtiin. Ruotuväessä oleminen opetti paljon erilaisten asiakkaiden kanssa työskelentemisestä, haastatteluiden pitämisestä sekä artikkeleiden kirjoittamisesta lehteen.",
        "Sanomalehtien jakamista yövuorossa",
        "Golffiin liittyviä työtehtäviä esimerkiksi pallojen keräämistä rangelta."
      ],
      "read_more": "Lue lisää",
      "read_less": "Lue vähemmän",
    "read_abstract": "Gradun tiivistelmä",
    "aalto-abstract": "Tämän tutkimuksen tavoitteena on selvittää voiko pelaajan siirtosumman selittää pelaajan aikaisempien kausien suoritusten perusteella. \nDataa kerättiin viiden eri maan korkeimmalta sarjatasolta. Nämä maat ovat Englanti, Ranska, Saksa, Italia ja Espanja. Nämä sarjat ovat suurimmat jalkapallosarjat maailmassa. Pelkästään kesällä tapahtuneet siirrot huomioidaan. Siirrot kerätään vuosilta 2018, 2019, 2020, 2021, 2022, 2023 ja 2024. Pelaajista, jotka siirtyivät näinä vuosina, on kerätty tilastoja aikaisemmilta kausilta. Useita datapisteitä on jätetty pois, esimerkiksi lainasiirrot, ilmaiset siirrot sekä maalivahdit on rajattu pois. Lisäksi puutteelliset datapisteet on poistettu, kuten tapaukset, joissa sopimuksen pituutta ei ole saatavilla. Data on jaettu puolustajiin, keskikenttäpelaajiin ja hyökkääjiin, joille kullekin on oma regressiomallinsa. Muuttujia muutetaan ennen muuttujien valinnan tekemistä. Data jaetaan opetus- ja testidatan 80/20 jaolla. \nLineaarinen regressio on tutkimuksen pääasiallinen regressiomalli. Muuttujien valinta tehdään poistovalinnalla. Lisäksi käytetään LASSO-regressiota sekä satunnaismetsäregressiota ennustustarkkuuden ja selitetyn varianssin vertailua varten. LASSO-regression valitsee omat muuttujansa, kun taas muuttujan valinta algoritmi -Boruta:a käytetään satunnaismetsämalliin. Mallien tulokset käydään läpi sanallisesti, ja ennustusten virhearvoja ja R²- sekä korjattuja R² -lukuja käytetään mallien ja niiden tulosten vertailemiseen. \nLineaarisen regression tulokset osoittavat, että ikä, sopimuksen kesto, sekä Valioliigaan siirtyminen tai sieltä pois siirtyminen ovat tilastollisesti merkitseviä riippumatta pelaajakategoriasta. Näiden ei-suorituskykyyn liittyvien muuttujien lisäksi jokaisella pelaajakategorialla on useita tilastollisesti merkitseviä suorituskykyyn perustuvia selittäviä muuttujia. Puolustajille nämä ovat: pääpallojen voittoprosentti, kosketukset hyökkäyskolmanneksella, hävityt kaksinkamppailut, keskipitkien syöttöjen onnistumisprosentti, taklaukset keskikolmanneksella, npxG + xAG sekä palloa ylöspäin kuljetettu matka. Keskikenttäpelaajilla ne ovat maalipaikkoihin johtaneet suoritukset, katkot, hävityt kaksinkamppailut, syötöt hyökkäyskolmannekselle, syöttöjen onnistumisprosentti, pallonriistot ja xG. Hyökkääjillä nämä ovat epäonnistuneet haltuunotot, syöttöjen onnistumisprosentti, maalia kohti suuntautuneiden laukauksien prosenttiosuus, maaliin johtaneet ohitukset, taklattu harhautuksen aikana -prosenttiosuus, xAG ja xG. \nTulokset osoittavat, että on jossain määrin mahdollista selittää pelaajan siirtosumma hänen suorituskykytilastojensa pohjalta. Rajoitteita kuitenkin on, joten tuloksia pitää tulkita varovaisesti.",
    "tampere-abstract": "Jalkapallo-otteluiden mallintamista on tutkittu 1960-luvulta lähtien. Vaikka eri malleja ja muuttujia on käytetty, niin aikaisempi kirjallisuus liittyen maaliodottaman (xG) hyödyntämiseen muuttujana on vähäistä. Tämän tutkimuksen tarkoituksena on selvittää, miten xG:tä voidaan hyödyntää aikaisempien tulosten simuloimisessa, mitä puolestaan voidaan hyödyntää tulevien otteluiden ennustamisessa. Lisäksi tämän tutkimuksen tavoitteena on automatisoida koko prosessi jatkuvan integraation (CI) ja jatkuvan käyttöönoton (CD) avulla, luoden MLOps-tyylisen putken ennustuksia varten. \nTutkimus sisältää kattavan taustan ja kirjallisuuskatsauksen aiheesta. Tätä seuraa tulosten simuloiminen ja ennustaminen. Mallin historialliset tulokset perustuvat Englannin Valioliigan kausiin 2020/2021–2024/2025. Otteluiden laukausten xG-arvoja hyödynnettiin yhdessä Monte Carlo -simulaation kanssa pelattujen otteluiden tulosten simuloimiseen. Näitä simuloituja tuloksia hyödynnettiin tulevien otteluiden ennustamisessa, joka tapahtuu riippumattoman Poisson-jakauman avulla. Poisson-jakauman λ-arvot perustuivat koti- sekä vierasjoukkueen pelattujen otteluiden esityksiin. CI/CD-putki ajautui automaattisesti joka päivä, ja jokaisen ottelukierroksen jälkeen tulokset simuloitiin xG:n pohjalta, ja λ-arvot päivitettiin. Seuraavan ottelukierroksen ennustukset tehtiin uusilla arvojen avulla ja nämä tulokset lähetettiin automaattisena Telegram-viestinä. Vertailumallina käytettiin vedonlyöntitoimistojen tarjoamien kertoimien keskiarvoa, jota on hyödynnetty myös aikaisemmissa tutkimuksissa. Mallin suorituskykyä katsottiin neljän eri mittarin avulla. Nämä olivat tarkkuus, sijoitetun pääoman tuotto, keskimääräinen binomidevianssivirhe sekä keskineliövirhe. \nTutkimuksen malli kykeni saavuttamaan tuottoisuuden pitkällä aikavälillä. Jos kaikki historiallisten kausien ennustukset otettiin huomioon, ennustustarkkuus oli 50.67 % ja sijoitetun pääoman tuotto -0.77 % 1 800:n ottelun otoskoolla. Malli kuitenkin suoriutui huomattavasti paremmin kauden loppupuolella, etenkin kun huomioon otetaan vain ne ottelut, jossa mallilla oli korkea luottamus. Jos vain kauden jälkimmäinen puolisko otettiin huomioon, tarkkuus vaihteli 75 % ja 87 % välillä korkean luottamuksen otteluissa. Sijoitetun pääoman tuottoprosentit vaihtelivat 7 % ja 12 % välillä. Riippumaton Poisson-jakauma oli tuottavampi kuin vertailumalli suurimmassa osassa tapauksia, vaikka tarkkuus oli alhaisempi. \nRajoitteisiin kuului mallin yksinkertaisuus sekä se, että malli oli vain xG-pohjainen ja jättää ulkopuolelle mahdollisesti ennustuksiin vaikuttavia oleellisia muuttujia. Lisäksi xG:llä itsellään on myös rajoitteita. Tulokset ovat rohkaisevia, riippumatta tutkimuksen rajoitteista.",
    "lang-ski": "Kielitaito",
    "lang-ski-list": ["suomi (Äidinkieli)", "englanti (Erinomainen)", "ruotsi (Hyvä)"],
    "IT-ski": "IT osaaminen",
    "IT-ski-list": ["Microsoft Office (Erinomainen)", "Power BI (Erinomainen)", "SQL (Taitava)", "Python (Taitava)", "Web development (Kyvykäs)"],
    "cv_other_header": "Muuta",
    "cv_other": "Opiskeluiden ja osa-aikasen työskentelyn lisäksi, yritän olla mahdollisimman aktiivinen opiskelijayhteisöissä, sekä kauppiksen että koko Aallon puolella. Vuonna 2022 olin EnerKY:n hallituksessa, joka on kerho KY:llä, joka järkkää matalan kynnyksen urheiluun liittyviä tapahtumia. 2023 oon ollut KY-Vegasin hallituksessa, joka kokoo yhteen korttipeleistä kiinnostuneita henkilöitä. Lisäksi, ens vuonna oon Polin Pallon hallituksessa, joka on Aallon teekkareille kohdennettu futisjengi. Toimin vuoden 2024 sihteerinä sekä nettisivuvastaavana. Konkreettisia esimerkkejä tapahtumista mitä oon ollu mukana järkkäämässä: päivä Seikkailupuisto Korkeessa, texas hold'em- ja UNO-turnaukset Otaniemessä sekä info-iltoja. Erikokoisten tapahtumien järkkääminen on antoisaa ja lisäksi se on tuonut myös konkreettista tietoa ja taitoa, kuten: ryhmätyö-, ajanhallinnan- sekä markkinoinnin taitoja ja (opiskelija)yhteisöissä aktiivisena olemista. WordPress-nettisiuv jota ylläpidän löytyy täältä: ",
    "articleheader": "Kirjoitettuja artikkeleita Ruotuväen nettisivuille",
    "prog": "Ohjelmointiprojekteja",
    "prog_text": "Mun tekemiä projekteja sekä Pythonilla että JavaScriptilla löytyy mun Githubista. Siellä on sekä koulutehtäviä että erikokosia omia projekteja. Python-ohjelmat on enimmäkseen tehty alusta asti itse ja yks TS-projekti perustuu toisen tekemään koodiin.",
    "snapshots": "Esimerkkejä",
    "ravit_desc": "Reactilla ja Typescriptillä tehty ohjelma, joka on elektroninen version Ravit-juomapelistä.",
    "apartmentfinder_desc": "Python-ohjelma, joka etsii vuokra-asuntoja Oikotieltä annettujen kriteerien perusteella.",
    "kide_desc": "Python-ohjelma, jonka avulla saa ostettu lippuja Kide.appista. Toinen versio on auto-clicker Seleniumin avulla ja toinen API-versio requests- ja bs4-kirjastojen avulla.",
    "contact": "Ota yhteyttä",
    "form_desc": "Jos haluut ottaa yhteyttä niin laita viestiä vaikka LinkedInissä. Tän formin tarkotus on vaan yhdistää tietokantaan ja harjotella tietokantaan yhdistämistä, johon voi tallettaa dataa ja hakea sitä.",
    "form_name": "Nimi",
    "form_subject": "Aihe",
    "form_details": "Lisätietoja",
    "success_msg": "Viestin lähetys onnistui!",
    "behavioral-pres-header": "'Behavioral economics' ja tuotestrategia",
    "behavioral-pres-intro": "Olen erittäin kiinnostunut siitä, miten käyttäytymistaloustiedettä ja psykologiaa voidaan soveltaa tuotestrategiaan ja data-analytiikkaan. Alla on laatimani esitys, joka syventyy näihin käsitteisiin pelialalla. Vaikka esitys on pelialalla, niin käyttäytymistaloustiedettä ja psykologiaa voidaan soveltaa myös muissa aloilla. Laatu on huonohko kompression vuoksi. Esityksen diat voit ladata ",
    "here": "täältä",
    "pres-skip-text": "Voit käyttää alla olevia pikanäppäimiä siirtyäksesi suoraan esityksen tiettyihin aiheisiin:",
    "pres-pull-header": "Videopelien vetovoima",
    "pres-pull-btn1": "5m33s Itseohjautuvuusteoria ja flow-tila",
    "pres-pull-btn2": "10m44s Zeigarnik-efekti ja sosiaalinen yhteenkuuluvuus",
    "pres-be-header": "Käyttäytymistaloustiede",
    "pres-be-btn1": "15m07s Hinnoittelumallit",
    "pres-be-btn2": "21m26s Battle passit",
    "pres-be-btn3": "29m15s Loot boksit",
    "pres-be-btn4": "33m34s Rajoitetun ajan tarjoukset",
    "pres-be-btn5": "35m10s Henkilökohtaiset tarjoukset",
    "pres-kpi-header": "Keskeiset suorituskykymittarit (KPI)",
    "pres-kpi-btn1": "39m52s Pysyvyysmittarit",
    "pres-kpi-btn2": "41m57s Sitoutumismittarit",
    "pres-kpi-btn3": "47m01s Konversio- ja liikevaihtomittarit",
    "pres-kpi-btn4": "49m06s Henkilökohtaisten tarjousten ja kampanjoiden mittarit",
    "portfolio-header": "Portfolio",
    "portfolio-intro": "Alla oleva Power BI -raportti perustuu yllä olevaan videoesitykseen, mutta sitä on muokattu ja laajennettu perusteellisemmaksi. Raportissa käytetty datasetti on tekoälyn luoma demonstraatiotarkoituksessa.",
    "portfolio-wip": "Huomioithan: Tämä on työn alla, ja myöhemmin tulossa on kerrottu demo, joka näyttää millaisia oivalluksia raportista voidaan saada.",
    "portfolio-fullscreen-tip": "Jos raportti ei mahdu kokonaan näytölle, sen voi avata toiseen ikkunaan oikeasta alakulmasta.",
    "powerbi-embed-link": "Power BI -raportti on upotettu"
}
