{
    "finnish": "suomi",
    "english": "englanti",
    "swedish": "ruotsi",
    "homenav": "Koti",
    "about-header": "Minusta",
    "about": "Morjes mun nimi on Jere Pankka ja oon Aallossa maisteriopiskelijana pääaineena Information and Service Management (ISM). Kauppiksen kanditutkinnon suorittaminen ISM pääaineena ja tietotekniikka sivuaineena on tuonu mulle erinomaisen pohjan taloudessa, data-analytiikassa sekä vankan osaamisen webbidevauksessa. Perusteet on tullu koulun kautta mut suurin osa osaamisesta perustuu mun harrastuneisuuteen. Tekniseen osaamiseen kuuluu tällä hetkellä muun muassa:", 
    "about1": "Oon aina valmis oppimaan uutta eri teknologioista ja pyrinkin kehittämään ja laajentamaan mun osaamista erilaisten projektien avulla. Tällä hetkellä mua kiinnostaa eniten seuraavat työt: ohjelmistokehittäjä, full stack -kehittäjä, tuotepäällikkö sekä data analyst. Pidän mielen toki avoinna, koska mielenkiinnon kohteet saattaa vaihdella, etenkin jos tulee vastaan mahollisuuksia, jotka tuo esiin uusia teknologiaan liittyviä asioita ja näkökulmia. Ainoa varmuus on se että multa löytyy vahva palo työskennellä IT-alalla. Tällä hetkellä suunta on oikea, ja toivottavasti tulevaisuudessa työtehtävät monipuolistuu ja vastuu kasvaa, kun opinnot lähestyy loppua.",
    "work-exp": "Työkokemus",
    "jobs": [
        "Alma Talent Oy (18.2.2022-)",
        "Fazer Leipomot Oy (14.4.2020-5.8.2022)",
        "Puolustusvoimat (4.9.2020-11.3.2020)",
        "Mediatalo ESA (22.5.2019-20.5.2019)",
        "Vierumäki Golf Club Oy (4.6.2018-12.8.2018)"
      ],
    "jobdesc": [
        "Ensimmäiset 14 kuukautta tilinpäätösten oikaisemista. 5/2023 lähtien päävastuu Power BI -projektista. Tämä tuonut paljon uusia vastuita, kuten projektinhallintaa, haastatteluiden järjestämistä and niiden pitämistä kollegoiden kanssa, Power BI -ympäristön kehitys, palautteen kerääminen jne.",
        "Tehdastyöntekijänä. Täysiaikaisena 4/2020-8/2020 sekä 6/2021-8/2021 ja osa-aikaisena 8/2020-5/2021 ja 8/2021-8/2022.",
        "Ruotuväkilehdessä levikkisihteerinä. Asikaspalvelutehtäviä, Ruotuväen edustamista tapahtumissa esimerkiksi Studia-messuilla sekä juttujen kirjoittamista nettiin ja printtiin. Ruotuväessä oleminen opetti paljon erilaisten asiakkaiden kanssa työskelentemisestä, haastatteluiden pitämisestä sekä artikkeleiden kirjoittamisesta lehteen.",
        "Sanomalehtien jakamista yövuorossa",
        "Golffiin liittyviä työtehtäviä esimerkiksi pallojen keräämistä rangelta."
      ],
      "read_more": "Lue lisää",
      "read_less": "Lue vähemmän",
    "lang-ski": "Kielitaito",
    "lang-ski-list": ["suomi (Äidinkieli)", "englanti (Erinomainen)", "ruotsi (Tyydyttävä)", "ranska (Perusteet)"],
    "IT-ski": "IT osaaminen",
    "IT-ski-list": ["Microsoft Office (Erinomainen)", "Power BI (Erinomainen)", "SQL (Taitava)", "Python (Taitava)", "Web development (Kyvykäs)"],
    "cv_other_header": "Muuta",
    "cv_other": "Opiskeluiden ja osa-aikasen työskentelyn lisäksi, yritän olla mahdollisimman aktiivinen opiskelijayhteisöissä, sekä kauppiksen että koko Aallon puolella. Vuonna 2022 olin EnerKY:n hallituksessa, joka on kerho KY:llä, joka järkkää matalan kynnyksen urheiluun liittyviä tapahtumia. 2023 oon ollut KY-Vegasin hallituksessa, joka kokoo yhteen korttipeleistä kiinnostuneita henkilöitä. Lisäksi, ens vuonna oon Polin Pallon hallituksessa, joka on Aallon teekkareille kohdennettu futisjengi. Toimin vuoden 2024 sihteerinä sekä nettisivuvastaavana. Konkreettisia esimerkkejä tapahtumista mitä oon ollu mukana järkkäämässä: päivä Seikkailupuisto Korkeessa, texas hold'em- ja UNO-turnaukset Otaniemessä sekä info-iltoja. Erikokoisten tapahtumien järkkääminen on antoisaa ja lisäksi se on tuonut myös konkreettista tietoa ja taitoa, kuten: ryhmätyö-, ajanhallinnan- sekä markkinoinnin taitoja ja (opiskelija)yhteisöissä aktiivisena olemista. WordPress-nettisiuv jota ylläpidän löytyy täältä: ",
    "articleheader": "Kirjoitettuja artikkeleita Ruotuväen nettisivuille",
    "prog": "Ohjelmointiprojekteja",
    "prog_text": "Mun tekemiä projekteja sekä Pythonilla että JavaScriptilla löytyy mun Githubista. Siellä on sekä koulutehtäviä että erikokosia omia projekteja. Python-ohjelmat on enimmäkseen tehty alusta asti itse ja yks TS-projekti perustuu toisen tekemään koodiin. Tän portfolion koodi:",
    "snapshots": "Esimerkkejä",
    "ravit_desc": "Reactilla ja Typescriptillä tehty ohjelma, joka on elektroninen version Ravit-juomapelistä.",
    "apartmentfinder_desc": "Python-ohjelma, joka etsii vuokra-asuntoja Oikotieltä annettujen kriteerien perusteella.",
    "kide_desc": "Python-ohjelma, jonka avulla saa ostettu lippuja Kide.appista. Toinen versio on auto-clicker Seleniumin avulla ja toinen API-versio requests- ja bs4-kirjastojen avulla.",
    "contact": "Ota yhteyttä",
    "form_desc": "Jos haluut ottaa yhteyttä niin laita viestiä vaikka LinkedInissä. Tän formin tarkotus on vaan yhdistää tietokantaan ja harjotella tietokantaan yhdistämistä, johon voi tallettaa dataa ja hakea sitä.",
    "form_name": "Nimi",
    "form_subject": "Aihe",
    "form_details": "Lisätietoja",
    "success_msg": "Viestin lähetys onnistui!"
}
