{
    "finnish": "finska",
    "english": "engelska",
    "swedish": "svenska",
    "homenav": "Hem",
    "about-header": "Om mig",
    "about": "Jag heter Jere Pankka och jag är en M.Sc. Information and Service Management (ISM) student vid Aalto-universitetet. Att slutföra Information och Service Management som huvudämne och Datavetenskap som biämne i min kandidatexamen har gett mig stark expertis inom affärs- och dataanalys samt mellanliggande kunskaper inom webbutveckling. Grunderna har kommit genom examen, men programmering som hobby har medfört det mesta av mina färdigheter. Inlärda tekniska färdigheter inkluderar men är inte begränsade till:",
    "about1": "Jag är sugen på att lära mig mer om nya teknologier och att kunna arbeta med data. Därför hoppas jag att jag kan göra karriär som dataanalytiker eller mjukvaruutvecklare. Jag är på rätt spår då jag arbetar som Power BI-analytiker och förhoppningsvis kan jag ta mer ansvar och diversifiera mina arbetsuppgifter då mina studier går mot sitt slut om ett par år.",
    "work-exp": "Arbetserfarenhet",
    "jobs": [
        "Alma Talent Oy (18.2.2022-)",
        "Fazer Leipomot Oy (14.4.2020-5.8.2022)",
        "Försvarsmakten (4.9.2020-11.3.2020)",
        "Mediatalo ESA (22.5.2019-20.5.2019)",
        "Vierumäki Golf Club Oy (4.6.2018-12.8.2018)"
      ],
    "jobdesc": [
        "Tillbringade de första 14 månaderna med att bearbeta och göra justeringar av bokslut. Sedan 5/2023 har jag arbetat med ett PBI-projekt. Det aktuella arbetsuppdraget har medfört mycket ansvar då jag har varit ansvarig för det: projektledning, schemalägga intervjuer med kunder och genomföra dem med mina kollegor, utveckling av Power BI-miljön, samla in feedback av miljön mm.",
        "Heltidsanställd: 4/2020-8/2020 och 6/2021-8/2021 & Deltidsanställd: 8/2020-5/2021 och 8/2021-8/2022",
        "Gör min värnplikt i Ruotuväki, försvarsmaktens officiella tidning. Arbetar som kundtjänst och representerar Ruotuväki vid olika evenemang, som Studia. Vidare skrev jag artiklar, nyheter och kolumner för hemsida och tryck.",
        "Jobbade som papperspojke med nattskift.",
        "Golfrelaterade uppgifter som att samla golfbollar från driving range."
      ],
      "read_more": "Läs mera",
      "read_less": "Läs mindre",
    "lang-ski": "Språkkunskaper",
    "lang-ski-list": ["finska (Modersmål)", "engelska (Excellent)", "svenska (Tillfredsställande)", "franska (Grunderna)"],
    "IT-ski": "IT kunskaper",
    "IT-ski-list": ["Microsoft Office (Excellent)", "Power BI (Excellent)", "SQL (Skicklig)", "Python (Skicklig)", "Web development (Behörig)"],
    "cv_other_header": "Övrig",
    "cv_other": "Utöver mina studier och deltidsarbete försöker jag vara aktiv i studentgemenskapen, både på handelshögskolan och hela Aalto. 2022 satt jag i styrelsen för EnerKY, vilket är en klubb på KY som anordnar lågtröskelidrottsaktiviteter för andra elever. 2023 satt jag i styrelsen för KY-Vegas som samlar personer som är intresserade av olika kortspel. Dessutom kommer jag 2024 att sitta i styrelsen för Polin Pallo , som är ett fotbollslag riktat mot Teekkaris i Aalto. Några konkreta exempel på evenemang som jag har varit med och organiserat är: äventyrsparksdagen på Mustikkamaa, Texas Hold'em och UNO-turneringar i Otnäs och infoevenemang. Organisering av olika typer av evenemang av varierande storlek för andra studenter har varit fruktbart, och dessutom har det polerat min grupparbete, planering och marknadsföringsförmåga samt (student)gemenskapsengagemang.",
    "articleheader": "Artiklar skrivna för Ruotuväki online",
    "prog": "Programmeringsprojekt",
    "prog_text": "Projektet jag har gjort både med Python och React finns på min Github. Det finns projekt som är relaterade till kursuppgifter men de flesta är hobbyprojekt av olika storlek. Python-projekten är mestadels byggda från grunden av mig själv och ett JS-projekt är baserat på källkod av andra människor.",
    "snapshots": "Ögonblicksbilder",
    "ravit_desc": "Program gjort med React och Typescript som är en elektronisk version av dryckesspelet Ravit.",
    "apartmentfinder_desc": "Python-program som söker igenom lägenheter från Oikotie baserat på angivna kriterier.",
    "kide_desc": "Python-program för att köpa biljetter från Kide.app. Har både auto-clicker-version gjort med Selenium samt API-version gjort med requests och bs4.",
    "contact": "Kontakta mig",
    "form_desc": "Om du vill kontakta mig, skicka ett meddelande till mig via LinkedIn, till exempel. Syftet med detta formulär är att träna på att skriva kod som ansluter till extern databas och lagrar informationen",
    "form_name": "Namn",
    "form_subject": "Anledning",
    "form_details": "Detaljer",
    "success_msg": "Meddelande har skickats!"
}