{
    "finnish": "Finnish",
    "english": "English",
    "homenav": "Home",
    "about-header": "About me",
    "about": "My name is Jere Pankka and I'm a M.Sc. Information and Service Management (ISM) student at Aalto University. Completing Information and Service Management as major and Computer Science as a minor in my Bachelor's degree has brought me strong expertise in business and data analysis as well as intermediate knowledge in web development. The basics have come through the degree , however programming as a hobby has brought most of my skillset. I'm eager to learn more about new technologies and being able to work with data. Learnt technical skills include but are not limited to:",
    "about1": "I'm eager to learn more about new technologies and being able to work with data. Therefore, I'm hoping I can pursue a career as a data analyst or  a software developer. I'm at the right track as I'm working as a Power BI analyst and hopefully I'm able to gain more responsibility and diversify my work tasks as my studies are coming to an end in a couple of years.",
    "work-exp": "Work experience",
    "jobs": [
        "Alma Talent Oy (18.2.2022-)",
        "Fazer Leipomot Oy (14.4.2020-5.8.2022)",
        "Finnish Defence Forces (4.9.2020-11.3.2020)",
        "Mediatalo ESA (22.5.2019-20.5.2019)",
        "Vierum채ki Golf Club Oy (4.6.2018-12.8.2018)"
      ],
    "jobdesc": [
        "Spent the first 14 months processing and making adjustments to financial statements. Since 5/2023 I have been working on a PBI project. The current work assignment has brought me a lot of responsibilities as I have been in charge of it: project management, scheduling interviews with customers and conducting them with my colleagues, the development of the Power BI environment, collecting feedback of the environment etc.",
        "Full-time employee: 4/2020-8/2020 and 6/2021-8/2021 & Part-time employee: 8/2020-5/2021 and 8/2021-8/2022",
        "Doing my military service in Ruotuv채ki, the official newspaper of the Finnish Defence Forces. Working as a customer servant and representing Ruotuv채ki in different events, such as Studia. Furthermore, I wrote articles, news and columns for the website and print.",
        "Worked as a paperboy doing night shifts.",
        "Golf related tasks such as collecting golf balls from the driving range."
      ],
      "read_more": "Read more",
      "read_less": "Read less",
    "lang-ski": "Language skills",
    "lang-ski-list": ["Finnish (Mother tongue)", "English (Excellent)", "Swedish (Satisfactory)", "French (Basics)"],
    "IT-ski": "IT skills",
    "IT-ski-list": ["Microsoft Office (Excellent)", "Power BI (Excellent)", "SQL (Proficient)", "Python (Proficient)", "Web development (Competent)"],
    "showcase": "Showcase",
    "articleheader": "Articles written for Ruotuv채ki online",
    "prog": "Programming projects",
    "prog_text": "The project I have done both with Python and JavaScript can be found on my Github. There are projects that are related to course tasks but most of them are hobby projects of different sizes. The Python projects are mostly built from scratch by myself (including help from Stackoverflow and such) and one JS project is based on source code by other people.",
    "snapshots": "Snapshots",
    "ravit_desc": "Program made with React and Typescript that is an electronic version of the drinking game Ravit.",
    "apartmentfinder_desc": "Python program that searches apartments from Oikotie based on criteria given.",
    "kide_desc": "Python program for buying tickets from Kide.app. Has both auto-clicker version done with Selenium as well as API version done with requests and bs4."
}